//HERC01C JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC DD DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
// EXEC K2KCOBCL
//COPY.SYSUT1 DD DSN=HERC01.CBLSRC,DISP=SHR
/*
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY TESTCOB
 NAME TESTCOB(R)
