//HERC01M JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC DD DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
// EXEC KIKMAPS,MAPNAME=TESTMSD
//COPY.SYSUT1 DD DSN=HERC01.MAPSRC,DISP=SHR
/*
