TESTMSD  DFHMSD MODE=INOUT,CTRL=FREEKB,                                *
               DSATTS=(COLOR),MAPATTS=(COLOR),                         *
               TYPE=&SYSPARM,LANG=COBOL,TIOAPFX=YES
*
TESTMAP  DFHMDI SIZE=(24,80),COLOR=TURQUOISE
*
MAPX01   DFHMDF POS=(01,01),LENGTH=17,INITIAL='KSGM for tso user'
         DFHMSD TYPE=FINAL
         END
