//HERC01C JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC DD DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
// EXEC K2KCOBCL
//COPY.SYSUT1 DD DSN=HERC01.PAYSRC,DISP=SHR
/*
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY PAYMCOB
 NAME PAYMCOB(R)
// EXEC K2KCOBCL
//COPY.SYSUT1 DD DSN=HERC01.MAINSRC,DISP=SHR
/*
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY MAINCOB
 NAME MAINCOB(R)
